src/app/Providers/CustomCheckEmail.php

    public function boot()
    {

        Validator::extend('checkEmail', function ($attribute, $value, $parameters, $validator) {
            $user = UserModel::whereUserName($parameters[0])->first();
---
select * from `users` where `user_name` = 'Dima2' limit 1