src/app/Services/AuthService.php

select * from `users` where `username` = 'Dima' limit 1
update `users` set `token` = '075fb6c3-7172-4cbd-9596-3d7d5a5e1aaa', `users`.`updated_at` = '2020-02-03 22:13:45' where `id` = 6
---
    public function getToken(GetTokenReguest $reguest){
        $user = User::whereUsername($reguest->get('username'))->first();

        if (!$user){
            return null;
        }
        if (!Hash::check($reguest->password,$user->password)){
            return null;
        }
        $token = Uuid::uuid4()->toString();
        $user->token = $token;
        $user->save();