src/app/Services/AuthoriseUserServices.php

    public function auth(Request $request)
    {
        $faker = Faker\Factory::create();
        $user = UserModel::whereUserName($request->get('username'))->first();

        if (!$user) {
            return null;
        }
        if (!Hash::check($request->password, $user->password)) {
            return null;
        }
        $tokensUser = TokenModel::whereUserId($user['user_id'])->get()->count();
        TokenModel::whereUserId($user['user_id'])
            ->where('created_at', '<', Carbon::now()->subMinutes(config('app')['lifetimeTokenMin'])->toDateTimeString())->delete();

        if ($tokensUser <= 3) {
            $token = $faker->uuid();
            (new TokenModel([
                'user_id' => $user['user_id'],
                'token' => $token
            ]))->save();
            return $token;
        } else {
            $token = TokenModel::whereUserId($user['user_id'])->first();
---
select * from `users` where `user_name` = 'Dima5' limit 1
select * from `token` where `user_id` = 5 and date(`created_at`) < '2020-02-04 20:49:06'
delete from `token` where `user_id` = 8 and `created_at` < '2020-02-05 02:51:21'
insert into `token` (`user_id`, `token`) values (8, 'e49670b2-81a2-3af5-ba77-5e3b81eefad1')
select * from `token` where `user_id` = 5 limit 1