src/app/Services/RegistrationUserServices.php

    public function registerUser(RegistrationRequest $request)
    {
        $faker = Faker\Factory::create();
        $tokenGenerate = $faker->uuid();
        (new UserModel([
            'user_name'=>$request->username,
            'password'=>Hash::make($request->get('password')),
            'email'=>$request->email
        ]))->save();

        $user = UserModel::whereUserName($request->username)->first('user_id');

        (new TokenModel([
            'user_id' => $user['user_id'],
            'token' => $tokenGenerate,
        ]))->save();
---
select * from `users` where `user_name` = 'Dima1' limit 1
insert into `users` (`user_name`, `password`, `email`) values ('spirit', 'y$bifeKrDbMU9FHOw44cQGnu.cl8Wj7J1TwoQ0JlCEEg2CnkmzIcMFu', 'spirit.97@inbox.ru')
select `user_id` from `users` where `user_name` = 'spirit' limit 1
insert into `token` (`user_id`, `token`) values (14, 'd2e91a1e-9ae9-38ee-a176-8025f474af9e')