src/app/Services/UserSercvices.php

insert into `users` (`username`, `email`, `password`, `updated_at`, `created_at`) values ('Dima', 'spirit.92@inbox.ru', 'yPbuGmQzblioWsFdzI5Au.nQ41so2IZzCF10DYdyZ/ycbgkleWWM2', '2020-02-03 22:09:24', '2020-02-03 22:09:24')
---
    public function store(RegisterUserRequest $request):User
    {
      $user =  new User([
            'username'=>$request->get('username'),
            'email'=>$request->get('email'),
            'password'=>Hash::make($request->get('password'))
        ]);
      $user->save();